Tekla Open API Reference for Tekla Structures 2025
PolyBeam Constructor (PolyBeam.PolyBeamTypeEnum)
 Initializes a new instance of the PolyBeam class by using the defined type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolyBeam(
	PolyBeam.PolyBeamTypeEnum polyBeamType
)
Public Sub New (
	polyBeamType As PolyBeam.PolyBeamTypeEnum
)
Parameters
polyBeamType
Type: Tekla.Structures.Model.PolyBeam.PolyBeamTypeEnum
The type of the polybeam.
See Also
Reference
PolyBeam Class
PolyBeam Overload
Tekla.Structures.Model Namespace